app/controllers/categories_controller.rb

  def create

    p "teste"
    p category_params
    p "teste"

    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", ""], ["created_at", "2015-04-29 16:39:44.131058"], ["updated_at", "2015-04-29 16:39:44.131058"]]